articlelist/app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "published", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "qwerqwrq"], ["body", "qwrqwrqw"], ["published", 0], ["created_at", "2023-04-30 19:44:02.201186"], ["updated_at", "2023-04-30 19:44:02.201186"]]
---
  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save